{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      ":": 12,
      "_": 13,
      "a": 14,
      "d": 15,
      "e": 16,
      "g": 17,
      "i": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "r": 22,
      "s": 23,
      "Ċ": 24,
      "Ġ": 25,
      "Ġ6": 26,
      "Ġ0": 27,
      "Ġ9": 28,
      "Ġ4": 29,
      "Ġ3": 30,
      "Ġ1": 31,
      "Ġ5": 32,
      "Ġ2": 33,
      "Ġ8": 34,
      "Ġ7": 35,
      "ai": 36,
      "de": 37,
      "dg": 38,
      "es": 39,
      "edg": 40,
      "no": 41,
      "pai": 42,
      "Ġedg": 43,
      "node": 44,
      "pair": 45,
      "Ġedges": 46,
      "10": 47,
      "32": 48,
      "45": 49,
      "74": 50,
      "90": 51,
      "29": 52,
      "91": 53,
      "78": 54,
      "17": 55,
      "40": 56,
      "52": 57,
      "16": 58,
      "80": 59,
      "97": 60,
      "37": 61,
      "42": 62,
      "55": 63,
      "72": 64,
      "14": 65,
      "76": 66,
      "65": 67,
      "23": 68,
      "46": 69,
      "21": 70,
      "31": 71,
      "26": 72,
      "49": 73,
      "93": 74,
      "94": 75,
      "22": 76,
      "77": 77,
      "75": 78,
      "19": 79,
      "64": 80,
      "68": 81,
      "53": 82,
      "58": 83,
      "67": 84,
      "28": 85,
      "57": 86,
      "56": 87,
      "50": 88,
      "69": 89,
      "86": 90,
      "95": 91,
      "11": 92,
      "48": 93,
      "54": 94,
      "43": 95,
      "59": 96,
      "66": 97,
      "27": 98,
      "98": 99,
      "12": 100,
      "83": 101,
      "85": 102,
      "13": 103,
      "30": 104,
      "44": 105,
      "87": 106,
      "34": 107,
      "15": 108,
      "39": 109,
      "33": 110,
      "41": 111,
      "51": 112,
      "84": 113,
      "25": 114,
      "96": 115,
      "99": 116,
      "63": 117,
      "35": 118,
      "100": 119,
      "36": 120,
      "62": 121,
      "47": 122,
      "79": 123,
      "38": 124,
      "71": 125,
      "73": 126,
      "18": 127,
      "24": 128,
      "70": 129,
      "92": 130,
      "81": 131,
      "82": 132,
      "61": 133,
      "20": 134,
      "88": 135,
      "60": 136,
      "89": 137
    },
    "merges": [
      "Ġ 6",
      "Ġ 0",
      "Ġ 9",
      "Ġ 4",
      "Ġ 3",
      "Ġ 1",
      "Ġ 5",
      "Ġ 2",
      "Ġ 8",
      "Ġ 7",
      "a i",
      "d e",
      "d g",
      "e s",
      "e dg",
      "n o",
      "p ai",
      "Ġ edg",
      "no de",
      "pai r",
      "Ġedg es",
      "1 0",
      "3 2",
      "4 5",
      "7 4",
      "9 0",
      "2 9",
      "9 1",
      "7 8",
      "1 7",
      "4 0",
      "5 2",
      "1 6",
      "8 0",
      "9 7",
      "3 7",
      "4 2",
      "5 5",
      "7 2",
      "1 4",
      "7 6",
      "6 5",
      "2 3",
      "4 6",
      "2 1",
      "3 1",
      "2 6",
      "4 9",
      "9 3",
      "9 4",
      "2 2",
      "7 7",
      "7 5",
      "1 9",
      "6 4",
      "6 8",
      "5 3",
      "5 8",
      "6 7",
      "2 8",
      "5 7",
      "5 6",
      "5 0",
      "6 9",
      "8 6",
      "9 5",
      "1 1",
      "4 8",
      "5 4",
      "4 3",
      "5 9",
      "6 6",
      "2 7",
      "9 8",
      "1 2",
      "8 3",
      "8 5",
      "1 3",
      "3 0",
      "4 4",
      "8 7",
      "3 4",
      "1 5",
      "3 9",
      "3 3",
      "4 1",
      "5 1",
      "8 4",
      "2 5",
      "9 6",
      "9 9",
      "6 3",
      "3 5",
      "10 0",
      "3 6",
      "6 2",
      "4 7",
      "7 9",
      "3 8",
      "7 1",
      "7 3",
      "1 8",
      "2 4",
      "7 0",
      "9 2",
      "8 1",
      "8 2",
      "6 1",
      "2 0",
      "8 8",
      "6 0",
      "8 9"
    ]
  }
}