{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      "Ċ": 12,
      "Ġ": 13,
      "Ġ1": 14,
      "10": 15,
      "11": 16,
      "12": 17,
      "13": 18,
      "14": 19,
      "15": 20,
      "16": 21,
      "17": 22,
      "18": 23,
      "19": 24,
      "Ġ19": 25,
      "Ġ8": 26,
      "Ġ3": 27,
      "Ġ5": 28,
      "Ġ16": 29,
      "Ġ6": 30,
      "Ġ13": 31,
      "Ġ0": 32,
      "Ġ2": 33,
      "Ġ18": 34,
      "Ġ12": 35,
      "Ġ9": 36,
      "Ġ15": 37,
      "Ġ7": 38,
      "Ġ11": 39,
      "Ġ4": 40,
      "Ġ17": 41,
      "Ġ14": 42,
      "Ġ10": 43
    },
    "merges": [
      "Ġ 1",
      "1 0",
      "1 1",
      "1 2",
      "1 3",
      "1 4",
      "1 5",
      "1 6",
      "1 7",
      "1 8",
      "1 9",
      "Ġ1 9",
      "Ġ 8",
      "Ġ 3",
      "Ġ 5",
      "Ġ1 6",
      "Ġ 6",
      "Ġ1 3",
      "Ġ 0",
      "Ġ 2",
      "Ġ1 8",
      "Ġ1 2",
      "Ġ 9",
      "Ġ1 5",
      "Ġ 7",
      "Ġ1 1",
      "Ġ 4",
      "Ġ1 7",
      "Ġ1 4",
      "Ġ1 0"
    ]
  }
}