#version: 0.2
Ġ 7
Ġ 5
Ġ 3
Ġ 6
Ġ 1
Ġ 2
Ġ 4
Ġ 8
Ġ 9
Ġ3 6
Ġ8 5
Ġ5 7
Ġ7 2
Ġ7 5
Ġ6 6
Ġ7 6
Ġ7 8
Ġ5 6
Ġ4 0
Ġ9 4
Ġ3 1
Ġ3 9
Ġ4 9
Ġ7 9
Ġ1 5
Ġ5 5
Ġ2 6
Ġ8 7
Ġ1 9
Ġ6 5
Ġ1 3
Ġ2 8
Ġ6 0
Ġ4 4
Ġ2 0
Ġ5 8
Ġ9 8
Ġ8 1
Ġ6 7
Ġ 0
Ġ5 9
Ġ9 5
Ġ5 3
Ġ8 8
Ġ8 4
Ġ5 1
Ġ5 2
Ġ1 8
Ġ2 1
Ġ9 2
Ġ4 3
Ġ1 7
Ġ3 4
Ġ7 0
Ġ1 6
Ġ7 3
Ġ3 0
Ġ2 9
Ġ6 4
Ġ1 1
Ġ8 2
Ġ2 3
Ġ9 6
Ġ4 1
Ġ3 3
Ġ7 4
Ġ6 8
Ġ4 5
Ġ6 3
Ġ2 5
Ġ4 2
Ġ1 2
Ġ3 2
Ġ3 5
Ġ9 7
Ġ2 2
Ġ8 0
Ġ3 7
Ġ1 4
Ġ4 6
Ġ5 4
Ġ7 7
Ġ3 8
Ġ6 9
Ġ2 4
Ġ9 9
Ġ8 6
Ġ4 8
Ġ6 2
Ġ5 0
Ġ6 1
Ġ7 1
Ġ9 0
Ġ9 1
Ġ8 3
Ġ4 7
Ġ1 0
Ġ2 7
Ġ8 9
Ġ9 3
8 2
8 5
2 2
6 7
6 6
9 3
8 7
5 0
2 6
6 8
1 5
7 0
3 4
2 4
2 3
1 0
3 5
3 9
9 9
6 1
5 3
9 4
1 2
5 8
2 7
2 1
9 5
1 7
8 0
9 6
5 2
7 1
4 4
4 8
1 8
9 2
4 7
5 9
4 6
5 6
9 1
4 0
4 1
2 5
7 2
3 6
6 0
9 7
8 9
5 7
8 1
3 2
4 2
7 6
6 4
1 4
6 2
7 9
8 3
1 9
6 9
5 5
8 4
8 8
8 6
4 9
1 3
3 8
7 4
1 1
4 3
7 7
2 9
5 1
2 0
4 5
7 5
9 0
5 4
7 8
9 8
3 7
1 6
6 3
7 3
2 8
3 3
6 5
3 1
3 0
