{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "0": 1,
      "1": 2,
      "2": 3,
      "3": 4,
      "4": 5,
      "5": 6,
      "6": 7,
      "7": 8,
      "8": 9,
      "9": 10,
      "Ċ": 11,
      "Ġ": 12,
      "Ġ7": 13,
      "Ġ5": 14,
      "Ġ3": 15,
      "Ġ6": 16,
      "Ġ1": 17,
      "Ġ2": 18,
      "Ġ4": 19,
      "Ġ8": 20,
      "Ġ9": 21,
      "Ġ36": 22,
      "Ġ85": 23,
      "Ġ57": 24,
      "Ġ72": 25,
      "Ġ75": 26,
      "Ġ66": 27,
      "Ġ76": 28,
      "Ġ78": 29,
      "Ġ56": 30,
      "Ġ40": 31,
      "Ġ94": 32,
      "Ġ31": 33,
      "Ġ39": 34,
      "Ġ49": 35,
      "Ġ79": 36,
      "Ġ15": 37,
      "Ġ55": 38,
      "Ġ26": 39,
      "Ġ87": 40,
      "Ġ19": 41,
      "Ġ65": 42,
      "Ġ13": 43,
      "Ġ28": 44,
      "Ġ60": 45,
      "Ġ44": 46,
      "Ġ20": 47,
      "Ġ58": 48,
      "Ġ98": 49,
      "Ġ81": 50,
      "Ġ67": 51,
      "Ġ0": 52,
      "Ġ59": 53,
      "Ġ95": 54,
      "Ġ53": 55,
      "Ġ88": 56,
      "Ġ84": 57,
      "Ġ51": 58,
      "Ġ52": 59,
      "Ġ18": 60,
      "Ġ21": 61,
      "Ġ92": 62,
      "Ġ43": 63,
      "Ġ17": 64,
      "Ġ34": 65,
      "Ġ70": 66,
      "Ġ16": 67,
      "Ġ73": 68,
      "Ġ30": 69,
      "Ġ29": 70,
      "Ġ64": 71,
      "Ġ11": 72,
      "Ġ82": 73,
      "Ġ23": 74,
      "Ġ96": 75,
      "Ġ41": 76,
      "Ġ33": 77,
      "Ġ74": 78,
      "Ġ68": 79,
      "Ġ45": 80,
      "Ġ63": 81,
      "Ġ25": 82,
      "Ġ42": 83,
      "Ġ12": 84,
      "Ġ32": 85,
      "Ġ35": 86,
      "Ġ97": 87,
      "Ġ22": 88,
      "Ġ80": 89,
      "Ġ37": 90,
      "Ġ14": 91,
      "Ġ46": 92,
      "Ġ54": 93,
      "Ġ77": 94,
      "Ġ38": 95,
      "Ġ69": 96,
      "Ġ24": 97,
      "Ġ99": 98,
      "Ġ86": 99,
      "Ġ48": 100,
      "Ġ62": 101,
      "Ġ50": 102,
      "Ġ61": 103,
      "Ġ71": 104,
      "Ġ90": 105,
      "Ġ91": 106,
      "Ġ83": 107,
      "Ġ47": 108,
      "Ġ10": 109,
      "Ġ27": 110,
      "Ġ89": 111,
      "Ġ93": 112,
      "82": 113,
      "85": 114,
      "22": 115,
      "67": 116,
      "66": 117,
      "93": 118,
      "87": 119,
      "50": 120,
      "26": 121,
      "68": 122,
      "15": 123,
      "70": 124,
      "34": 125,
      "24": 126,
      "23": 127,
      "10": 128,
      "35": 129,
      "39": 130,
      "99": 131,
      "61": 132,
      "53": 133,
      "94": 134,
      "12": 135,
      "58": 136,
      "27": 137,
      "21": 138,
      "95": 139,
      "17": 140,
      "80": 141,
      "96": 142,
      "52": 143,
      "71": 144,
      "44": 145,
      "48": 146,
      "18": 147,
      "92": 148,
      "47": 149,
      "59": 150,
      "46": 151,
      "56": 152,
      "91": 153,
      "40": 154,
      "41": 155,
      "25": 156,
      "72": 157,
      "36": 158,
      "60": 159,
      "97": 160,
      "89": 161,
      "57": 162,
      "81": 163,
      "32": 164,
      "42": 165,
      "76": 166,
      "64": 167,
      "14": 168,
      "62": 169,
      "79": 170,
      "83": 171,
      "19": 172,
      "69": 173,
      "55": 174,
      "84": 175,
      "88": 176,
      "86": 177,
      "49": 178,
      "13": 179,
      "38": 180,
      "74": 181,
      "11": 182,
      "43": 183,
      "77": 184,
      "29": 185,
      "51": 186,
      "20": 187,
      "45": 188,
      "75": 189,
      "90": 190,
      "54": 191,
      "78": 192,
      "98": 193,
      "37": 194,
      "16": 195,
      "63": 196,
      "73": 197,
      "28": 198,
      "33": 199,
      "65": 200,
      "31": 201,
      "30": 202
    },
    "merges": [
      "Ġ 7",
      "Ġ 5",
      "Ġ 3",
      "Ġ 6",
      "Ġ 1",
      "Ġ 2",
      "Ġ 4",
      "Ġ 8",
      "Ġ 9",
      "Ġ3 6",
      "Ġ8 5",
      "Ġ5 7",
      "Ġ7 2",
      "Ġ7 5",
      "Ġ6 6",
      "Ġ7 6",
      "Ġ7 8",
      "Ġ5 6",
      "Ġ4 0",
      "Ġ9 4",
      "Ġ3 1",
      "Ġ3 9",
      "Ġ4 9",
      "Ġ7 9",
      "Ġ1 5",
      "Ġ5 5",
      "Ġ2 6",
      "Ġ8 7",
      "Ġ1 9",
      "Ġ6 5",
      "Ġ1 3",
      "Ġ2 8",
      "Ġ6 0",
      "Ġ4 4",
      "Ġ2 0",
      "Ġ5 8",
      "Ġ9 8",
      "Ġ8 1",
      "Ġ6 7",
      "Ġ 0",
      "Ġ5 9",
      "Ġ9 5",
      "Ġ5 3",
      "Ġ8 8",
      "Ġ8 4",
      "Ġ5 1",
      "Ġ5 2",
      "Ġ1 8",
      "Ġ2 1",
      "Ġ9 2",
      "Ġ4 3",
      "Ġ1 7",
      "Ġ3 4",
      "Ġ7 0",
      "Ġ1 6",
      "Ġ7 3",
      "Ġ3 0",
      "Ġ2 9",
      "Ġ6 4",
      "Ġ1 1",
      "Ġ8 2",
      "Ġ2 3",
      "Ġ9 6",
      "Ġ4 1",
      "Ġ3 3",
      "Ġ7 4",
      "Ġ6 8",
      "Ġ4 5",
      "Ġ6 3",
      "Ġ2 5",
      "Ġ4 2",
      "Ġ1 2",
      "Ġ3 2",
      "Ġ3 5",
      "Ġ9 7",
      "Ġ2 2",
      "Ġ8 0",
      "Ġ3 7",
      "Ġ1 4",
      "Ġ4 6",
      "Ġ5 4",
      "Ġ7 7",
      "Ġ3 8",
      "Ġ6 9",
      "Ġ2 4",
      "Ġ9 9",
      "Ġ8 6",
      "Ġ4 8",
      "Ġ6 2",
      "Ġ5 0",
      "Ġ6 1",
      "Ġ7 1",
      "Ġ9 0",
      "Ġ9 1",
      "Ġ8 3",
      "Ġ4 7",
      "Ġ1 0",
      "Ġ2 7",
      "Ġ8 9",
      "Ġ9 3",
      "8 2",
      "8 5",
      "2 2",
      "6 7",
      "6 6",
      "9 3",
      "8 7",
      "5 0",
      "2 6",
      "6 8",
      "1 5",
      "7 0",
      "3 4",
      "2 4",
      "2 3",
      "1 0",
      "3 5",
      "3 9",
      "9 9",
      "6 1",
      "5 3",
      "9 4",
      "1 2",
      "5 8",
      "2 7",
      "2 1",
      "9 5",
      "1 7",
      "8 0",
      "9 6",
      "5 2",
      "7 1",
      "4 4",
      "4 8",
      "1 8",
      "9 2",
      "4 7",
      "5 9",
      "4 6",
      "5 6",
      "9 1",
      "4 0",
      "4 1",
      "2 5",
      "7 2",
      "3 6",
      "6 0",
      "9 7",
      "8 9",
      "5 7",
      "8 1",
      "3 2",
      "4 2",
      "7 6",
      "6 4",
      "1 4",
      "6 2",
      "7 9",
      "8 3",
      "1 9",
      "6 9",
      "5 5",
      "8 4",
      "8 8",
      "8 6",
      "4 9",
      "1 3",
      "3 8",
      "7 4",
      "1 1",
      "4 3",
      "7 7",
      "2 9",
      "5 1",
      "2 0",
      "4 5",
      "7 5",
      "9 0",
      "5 4",
      "7 8",
      "9 8",
      "3 7",
      "1 6",
      "6 3",
      "7 3",
      "2 8",
      "3 3",
      "6 5",
      "3 1",
      "3 0"
    ]
  }
}