#version: 0.2
Ġ 5
Ġ 9
Ġ 4
Ġ 6
Ġ 8
Ġ 3
Ġ 0
Ġ 2
Ġ 7
Ġ 1
1 0
1 4
5 1
8 6
1 8
4 5
9 6
5 8
5 6
3 5
4 0
9 2
1 9
8 9
2 0
9 1
4 4
5 3
7 9
6 3
4 9
1 1
4 6
7 0
8 4
1 3
7 8
3 8
7 2
3 9
5 5
5 2
6 0
3 7
3 2
6 1
10 0
4 1
6 4
8 0
7 3
5 4
5 7
3 6
4 3
7 7
8 3
9 3
2 4
2 1
6 5
8 7
2 8
4 7
9 7
2 9
3 0
7 1
9 4
9 5
1 7
2 5
8 1
8 5
7 6
1 6
3 3
3 4
6 2
6 7
8 8
1 5
2 7
9 8
1 2
2 3
6 9
9 9
4 8
9 0
6 6
2 2
5 0
5 9
7 5
2 6
8 2
4 2
6 8
7 4
3 1
