#version: 0.2
Ġ 1
Ġ 0
Ġ 6
Ġ 8
Ġ 9
Ġ 3
Ġ 7
Ġ 4
Ġ 5
Ġ 2
1 0
9 0
6 4
2 0
9 8
8 4
8 6
2 2
2 8
2 5
7 0
6 6
3 6
2 1
7 5
4 2
3 9
7 7
2 6
8 8
1 8
5 9
6 8
3 3
8 3
1 3
4 0
4 5
6 2
8 7
1 1
10 0
1 5
2 3
6 9
7 4
6 3
6 5
2 9
3 7
3 8
9 2
3 2
9 4
7 1
7 6
3 4
7 2
6 0
8 2
5 3
3 5
9 9
4 8
6 1
4 4
5 6
8 9
9 1
5 1
5 2
8 5
5 0
1 2
3 0
5 5
4 6
5 7
7 9
8 0
9 3
2 4
1 4
4 1
5 4
9 6
1 9
4 9
2 7
4 3
7 3
1 6
7 8
5 8
6 7
8 1
9 5
9 7
1 7
3 1
4 7
