{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      "Ċ": 12,
      "Ġ": 13,
      "Ġ1": 14,
      "Ġ0": 15,
      "Ġ6": 16,
      "Ġ8": 17,
      "Ġ9": 18,
      "Ġ3": 19,
      "Ġ7": 20,
      "Ġ4": 21,
      "Ġ5": 22,
      "Ġ2": 23,
      "10": 24,
      "90": 25,
      "64": 26,
      "20": 27,
      "98": 28,
      "84": 29,
      "86": 30,
      "22": 31,
      "28": 32,
      "25": 33,
      "70": 34,
      "66": 35,
      "36": 36,
      "21": 37,
      "75": 38,
      "42": 39,
      "39": 40,
      "77": 41,
      "26": 42,
      "88": 43,
      "18": 44,
      "59": 45,
      "68": 46,
      "33": 47,
      "83": 48,
      "13": 49,
      "40": 50,
      "45": 51,
      "62": 52,
      "87": 53,
      "11": 54,
      "100": 55,
      "15": 56,
      "23": 57,
      "69": 58,
      "74": 59,
      "63": 60,
      "65": 61,
      "29": 62,
      "37": 63,
      "38": 64,
      "92": 65,
      "32": 66,
      "94": 67,
      "71": 68,
      "76": 69,
      "34": 70,
      "72": 71,
      "60": 72,
      "82": 73,
      "53": 74,
      "35": 75,
      "99": 76,
      "48": 77,
      "61": 78,
      "44": 79,
      "56": 80,
      "89": 81,
      "91": 82,
      "51": 83,
      "52": 84,
      "85": 85,
      "50": 86,
      "12": 87,
      "30": 88,
      "55": 89,
      "46": 90,
      "57": 91,
      "79": 92,
      "80": 93,
      "93": 94,
      "24": 95,
      "14": 96,
      "41": 97,
      "54": 98,
      "96": 99,
      "19": 100,
      "49": 101,
      "27": 102,
      "43": 103,
      "73": 104,
      "16": 105,
      "78": 106,
      "58": 107,
      "67": 108,
      "81": 109,
      "95": 110,
      "97": 111,
      "17": 112,
      "31": 113,
      "47": 114
    },
    "merges": [
      "Ġ 1",
      "Ġ 0",
      "Ġ 6",
      "Ġ 8",
      "Ġ 9",
      "Ġ 3",
      "Ġ 7",
      "Ġ 4",
      "Ġ 5",
      "Ġ 2",
      "1 0",
      "9 0",
      "6 4",
      "2 0",
      "9 8",
      "8 4",
      "8 6",
      "2 2",
      "2 8",
      "2 5",
      "7 0",
      "6 6",
      "3 6",
      "2 1",
      "7 5",
      "4 2",
      "3 9",
      "7 7",
      "2 6",
      "8 8",
      "1 8",
      "5 9",
      "6 8",
      "3 3",
      "8 3",
      "1 3",
      "4 0",
      "4 5",
      "6 2",
      "8 7",
      "1 1",
      "10 0",
      "1 5",
      "2 3",
      "6 9",
      "7 4",
      "6 3",
      "6 5",
      "2 9",
      "3 7",
      "3 8",
      "9 2",
      "3 2",
      "9 4",
      "7 1",
      "7 6",
      "3 4",
      "7 2",
      "6 0",
      "8 2",
      "5 3",
      "3 5",
      "9 9",
      "4 8",
      "6 1",
      "4 4",
      "5 6",
      "8 9",
      "9 1",
      "5 1",
      "5 2",
      "8 5",
      "5 0",
      "1 2",
      "3 0",
      "5 5",
      "4 6",
      "5 7",
      "7 9",
      "8 0",
      "9 3",
      "2 4",
      "1 4",
      "4 1",
      "5 4",
      "9 6",
      "1 9",
      "4 9",
      "2 7",
      "4 3",
      "7 3",
      "1 6",
      "7 8",
      "5 8",
      "6 7",
      "8 1",
      "9 5",
      "9 7",
      "1 7",
      "3 1",
      "4 7"
    ]
  }
}