{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      "Ċ": 12,
      "Ġ": 13,
      "Ġ-": 14,
      "Ġ1": 15,
      "Ġ2": 16,
      "Ġ3": 17,
      "Ġ4": 18,
      "Ġ5": 19,
      "Ġ6": 20,
      "Ġ7": 21,
      "Ġ8": 22,
      "Ġ9": 23,
      "Ġ0": 24
    },
    "merges": [
      "Ġ -",
      "Ġ 1",
      "Ġ 2",
      "Ġ 3",
      "Ġ 4",
      "Ġ 5",
      "Ġ 6",
      "Ġ 7",
      "Ġ 8",
      "Ġ 9",
      "Ġ 0"
    ]
  }
}