{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "-": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      ":": 12,
      "_": 13,
      "a": 14,
      "d": 15,
      "e": 16,
      "g": 17,
      "i": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "r": 22,
      "s": 23,
      "Ċ": 24,
      "Ġ": 25,
      "Ġ7": 26,
      "Ġ9": 27,
      "Ġ4": 28,
      "Ġ3": 29,
      "ai": 30,
      "de": 31,
      "dg": 32,
      "es": 33,
      "edg": 34,
      "no": 35,
      "pai": 36,
      "Ġedg": 37,
      "node": 38,
      "pair": 39,
      "Ġedges": 40,
      "Ġ1": 41,
      "Ġ6": 42,
      "Ġ5": 43,
      "Ġ8": 44,
      "Ġ0": 45,
      "Ġ2": 46
    },
    "merges": [
      "Ġ 7",
      "Ġ 9",
      "Ġ 4",
      "Ġ 3",
      "a i",
      "d e",
      "d g",
      "e s",
      "e dg",
      "n o",
      "p ai",
      "Ġ edg",
      "no de",
      "pai r",
      "Ġedg es",
      "Ġ 1",
      "Ġ 6",
      "Ġ 5",
      "Ġ 8",
      "Ġ 0",
      "Ġ 2"
    ]
  }
}