{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "0": 1,
      "1": 2,
      "2": 3,
      "3": 4,
      "4": 5,
      "5": 6,
      "6": 7,
      "7": 8,
      "8": 9,
      "9": 10,
      ":": 11,
      "a": 12,
      "e": 13,
      "g": 14,
      "r": 15,
      "t": 16,
      "y": 17,
      "Ċ": 18,
      "Ġ": 19,
      "ar": 20,
      "Ġ6": 21,
      "Ġ8": 22,
      "Ġ1": 23,
      "Ġ3": 24,
      "Ġ4": 25,
      "Ġ7": 26,
      "Ġ5": 27,
      "Ġ2": 28,
      "Ġ9": 29,
      "ay": 30,
      "et": 31,
      "get": 32,
      "ray": 33,
      "tar": 34,
      "Ġtar": 35,
      "array": 36,
      "Ġtarget": 37,
      "Ġ62": 38,
      "Ġ70": 39,
      "Ġ66": 40,
      "Ġ60": 41,
      "Ġ49": 42,
      "Ġ98": 43,
      "Ġ52": 44,
      "Ġ31": 45,
      "Ġ89": 46,
      "Ġ37": 47,
      "Ġ28": 48,
      "Ġ59": 49,
      "Ġ86": 50,
      "Ġ15": 51,
      "Ġ79": 52,
      "Ġ95": 53,
      "Ġ80": 54,
      "Ġ83": 55,
      "Ġ61": 56,
      "Ġ63": 57,
      "Ġ97": 58,
      "Ġ48": 59,
      "Ġ77": 60,
      "Ġ12": 61,
      "Ġ58": 62,
      "Ġ16": 63,
      "Ġ32": 64,
      "Ġ68": 65,
      "Ġ38": 66,
      "Ġ22": 67,
      "Ġ39": 68,
      "Ġ96": 69,
      "Ġ21": 70,
      "Ġ50": 71,
      "Ġ40": 72,
      "Ġ76": 73,
      "Ġ81": 74,
      "Ġ84": 75,
      "Ġ69": 76,
      "Ġ20": 77,
      "Ġ17": 78,
      "Ġ0": 79,
      "Ġ44": 80,
      "Ġ18": 81,
      "Ġ94": 82,
      "Ġ91": 83,
      "Ġ43": 84,
      "Ġ36": 85,
      "Ġ78": 86,
      "Ġ46": 87,
      "Ġ42": 88,
      "Ġ34": 89,
      "Ġ93": 90,
      "Ġ24": 91,
      "Ġ82": 92,
      "Ġ11": 93,
      "Ġ87": 94,
      "Ġ54": 95,
      "Ġ10": 96,
      "Ġ19": 97,
      "Ġ74": 98,
      "Ġ33": 99,
      "Ġ85": 100,
      "Ġ13": 101,
      "Ġ47": 102,
      "Ġ26": 103,
      "Ġ56": 104,
      "Ġ41": 105,
      "Ġ29": 106,
      "Ġ35": 107,
      "Ġ65": 108,
      "Ġ25": 109,
      "Ġ72": 110,
      "Ġ55": 111,
      "Ġ53": 112,
      "Ġ57": 113,
      "Ġ67": 114,
      "Ġ14": 115,
      "Ġ45": 116,
      "Ġ73": 117,
      "Ġ51": 118,
      "Ġ88": 119,
      "Ġ75": 120,
      "Ġ64": 121,
      "Ġ71": 122,
      "Ġ99": 123,
      "Ġ23": 124,
      "Ġ27": 125,
      "Ġ30": 126,
      "Ġ90": 127,
      "Ġ92": 128
    },
    "merges": [
      "a r",
      "Ġ 6",
      "Ġ 8",
      "Ġ 1",
      "Ġ 3",
      "Ġ 4",
      "Ġ 7",
      "Ġ 5",
      "Ġ 2",
      "Ġ 9",
      "a y",
      "e t",
      "g et",
      "r ay",
      "t ar",
      "Ġ tar",
      "ar ray",
      "Ġtar get",
      "Ġ6 2",
      "Ġ7 0",
      "Ġ6 6",
      "Ġ6 0",
      "Ġ4 9",
      "Ġ9 8",
      "Ġ5 2",
      "Ġ3 1",
      "Ġ8 9",
      "Ġ3 7",
      "Ġ2 8",
      "Ġ5 9",
      "Ġ8 6",
      "Ġ1 5",
      "Ġ7 9",
      "Ġ9 5",
      "Ġ8 0",
      "Ġ8 3",
      "Ġ6 1",
      "Ġ6 3",
      "Ġ9 7",
      "Ġ4 8",
      "Ġ7 7",
      "Ġ1 2",
      "Ġ5 8",
      "Ġ1 6",
      "Ġ3 2",
      "Ġ6 8",
      "Ġ3 8",
      "Ġ2 2",
      "Ġ3 9",
      "Ġ9 6",
      "Ġ2 1",
      "Ġ5 0",
      "Ġ4 0",
      "Ġ7 6",
      "Ġ8 1",
      "Ġ8 4",
      "Ġ6 9",
      "Ġ2 0",
      "Ġ1 7",
      "Ġ 0",
      "Ġ4 4",
      "Ġ1 8",
      "Ġ9 4",
      "Ġ9 1",
      "Ġ4 3",
      "Ġ3 6",
      "Ġ7 8",
      "Ġ4 6",
      "Ġ4 2",
      "Ġ3 4",
      "Ġ9 3",
      "Ġ2 4",
      "Ġ8 2",
      "Ġ1 1",
      "Ġ8 7",
      "Ġ5 4",
      "Ġ1 0",
      "Ġ1 9",
      "Ġ7 4",
      "Ġ3 3",
      "Ġ8 5",
      "Ġ1 3",
      "Ġ4 7",
      "Ġ2 6",
      "Ġ5 6",
      "Ġ4 1",
      "Ġ2 9",
      "Ġ3 5",
      "Ġ6 5",
      "Ġ2 5",
      "Ġ7 2",
      "Ġ5 5",
      "Ġ5 3",
      "Ġ5 7",
      "Ġ6 7",
      "Ġ1 4",
      "Ġ4 5",
      "Ġ7 3",
      "Ġ5 1",
      "Ġ8 8",
      "Ġ7 5",
      "Ġ6 4",
      "Ġ7 1",
      "Ġ9 9",
      "Ġ2 3",
      "Ġ2 7",
      "Ġ3 0",
      "Ġ9 0",
      "Ġ9 2"
    ]
  }
}