{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      ",": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "7": 9,
      "8": 10,
      "9": 11,
      "Ċ": 12,
      "Ġ": 13,
      "Ġ3": 14,
      "Ġ1": 15,
      "Ġ9": 16,
      "Ġ5": 17,
      "Ġ4": 18,
      "Ġ8": 19,
      "Ġ6": 20,
      "Ġ7": 21,
      "Ġ2": 22,
      "Ġ95": 23,
      "Ġ98": 24,
      "Ġ75": 25,
      "Ġ55": 26,
      "Ġ17": 27,
      "Ġ45": 28,
      "Ġ63": 29,
      "Ġ37": 30,
      "Ġ19": 31,
      "Ġ32": 32,
      "Ġ49": 33,
      "Ġ35": 34,
      "Ġ90": 35,
      "Ġ53": 36,
      "Ġ81": 37,
      "Ġ33": 38,
      "Ġ16": 39,
      "Ġ89": 40,
      "Ġ57": 41,
      "Ġ85": 42,
      "Ġ13": 43,
      "Ġ82": 44,
      "Ġ71": 45,
      "Ġ73": 46,
      "Ġ30": 47,
      "Ġ46": 48,
      "Ġ76": 49,
      "Ġ58": 50,
      "Ġ44": 51,
      "Ġ12": 52,
      "Ġ26": 53,
      "Ġ64": 54,
      "Ġ22": 55,
      "Ġ88": 56,
      "Ġ69": 57,
      "Ġ36": 58,
      "Ġ92": 59,
      "Ġ72": 60,
      "Ġ99": 61,
      "Ġ93": 62,
      "Ġ67": 63,
      "Ġ50": 64,
      "Ġ29": 65,
      "Ġ27": 66,
      "Ġ43": 67,
      "Ġ15": 68,
      "Ġ86": 69,
      "Ġ31": 70,
      "Ġ40": 71,
      "Ġ28": 72,
      "Ġ20": 73,
      "Ġ54": 74,
      "Ġ66": 75,
      "Ġ87": 76,
      "Ġ10": 77,
      "Ġ60": 78,
      "Ġ78": 79,
      "Ġ59": 80,
      "Ġ84": 81,
      "Ġ34": 82,
      "Ġ38": 83,
      "Ġ52": 84,
      "Ġ83": 85,
      "Ġ0": 86,
      "Ġ39": 87,
      "Ġ56": 88,
      "Ġ79": 89,
      "Ġ14": 90,
      "Ġ91": 91,
      "Ġ94": 92,
      "Ġ25": 93,
      "Ġ41": 94,
      "Ġ62": 95,
      "Ġ68": 96,
      "Ġ23": 97,
      "Ġ48": 98,
      "Ġ18": 99,
      "Ġ47": 100,
      "Ġ80": 101,
      "Ġ77": 102,
      "Ġ11": 103,
      "Ġ70": 104,
      "Ġ61": 105,
      "Ġ42": 106,
      "Ġ21": 107,
      "Ġ96": 108,
      "Ġ97": 109,
      "Ġ51": 110,
      "Ġ65": 111,
      "Ġ74": 112,
      "Ġ24": 113
    },
    "merges": [
      "Ġ 3",
      "Ġ 1",
      "Ġ 9",
      "Ġ 5",
      "Ġ 4",
      "Ġ 8",
      "Ġ 6",
      "Ġ 7",
      "Ġ 2",
      "Ġ9 5",
      "Ġ9 8",
      "Ġ7 5",
      "Ġ5 5",
      "Ġ1 7",
      "Ġ4 5",
      "Ġ6 3",
      "Ġ3 7",
      "Ġ1 9",
      "Ġ3 2",
      "Ġ4 9",
      "Ġ3 5",
      "Ġ9 0",
      "Ġ5 3",
      "Ġ8 1",
      "Ġ3 3",
      "Ġ1 6",
      "Ġ8 9",
      "Ġ5 7",
      "Ġ8 5",
      "Ġ1 3",
      "Ġ8 2",
      "Ġ7 1",
      "Ġ7 3",
      "Ġ3 0",
      "Ġ4 6",
      "Ġ7 6",
      "Ġ5 8",
      "Ġ4 4",
      "Ġ1 2",
      "Ġ2 6",
      "Ġ6 4",
      "Ġ2 2",
      "Ġ8 8",
      "Ġ6 9",
      "Ġ3 6",
      "Ġ9 2",
      "Ġ7 2",
      "Ġ9 9",
      "Ġ9 3",
      "Ġ6 7",
      "Ġ5 0",
      "Ġ2 9",
      "Ġ2 7",
      "Ġ4 3",
      "Ġ1 5",
      "Ġ8 6",
      "Ġ3 1",
      "Ġ4 0",
      "Ġ2 8",
      "Ġ2 0",
      "Ġ5 4",
      "Ġ6 6",
      "Ġ8 7",
      "Ġ1 0",
      "Ġ6 0",
      "Ġ7 8",
      "Ġ5 9",
      "Ġ8 4",
      "Ġ3 4",
      "Ġ3 8",
      "Ġ5 2",
      "Ġ8 3",
      "Ġ 0",
      "Ġ3 9",
      "Ġ5 6",
      "Ġ7 9",
      "Ġ1 4",
      "Ġ9 1",
      "Ġ9 4",
      "Ġ2 5",
      "Ġ4 1",
      "Ġ6 2",
      "Ġ6 8",
      "Ġ2 3",
      "Ġ4 8",
      "Ġ1 8",
      "Ġ4 7",
      "Ġ8 0",
      "Ġ7 7",
      "Ġ1 1",
      "Ġ7 0",
      "Ġ6 1",
      "Ġ4 2",
      "Ġ2 1",
      "Ġ9 6",
      "Ġ9 7",
      "Ġ5 1",
      "Ġ6 5",
      "Ġ7 4",
      "Ġ2 4"
    ]
  }
}